/*
 * pacgen.c
 *
 *  Created on: 2011-01-04
 *      Author: wino
 */

#include <stdio.h>
#include "fpge.h"
#include "pacgen.h"
#include "tables.h"
#include "maingui.h"
#include "fpge_colors.h"
#include "pgf.h"
#include "drawmap.h"
#include "unitutil.h"
#include "unitlist.h"
#include "filename.h"
#include "load.h"

DIALOG pacgen_dlg[7+5+1-2]= {
/* 0 */ { d_textbox_proc,0,-16,198+16+60+2*18,30+18+12+18*4+16,GUI_FG_COLOR,GUI_BG_COLOR,0,0,0,0,0,0,0},
/* 1 */	{ d_text_proc,16,12,200,12,GUI_FG_COLOR,GUI_BG_COLOR,0,0,0,0,"Choose file to convert" },
/* 2 */	{ d_button_proc,22,30+18*4,96,18,GUI_FG_COLOR,GUI_BG_COLOR,'c',D_EXIT,0,0,"&Cancel" },
/* 3 */	{ d_button_proc,178+3*18-36,30+18*4,96,18,GUI_FG_COLOR,GUI_BG_COLOR,'s',D_EXIT,0,0,"&Load" },
/* 4 */	{ d_edit_proc,16,12+18,200,12,GUI_FG_COLOR,GUI_EDIT_COLOR,0,0,2,1,/*EDIT*/0},
/* 5 */ { d_radio_proc,16,30+18*1,60+70,18,GUI_FG_COLOR,GUI_BG_COLOR,0,D_SELECTED,95,0,"No not convert names"},
/* 6 */ { d_radio_proc,16,30+18*2,60+70,18,GUI_FG_COLOR,GUI_BG_COLOR,'p',0,95,0,"Add new names"},
/* 7 */	{ d_button_proc,200+2*18,12+18,60,18,GUI_FG_COLOR,GUI_BG_COLOR,'e',D_EXIT,0,0,"&File" },
/* 8 */ { d_text_proc,16+5*8,-8,200,12,GUI_FG_COLOR,GUI_BG_COLOR,0,0,0,0,"Load Pacific General file" },
{d_yield_proc,0,0,0,0,0,0,0,0,0,0,0,0,0},
 { NULL,0,0,0,0,0,0,0,0,0,0,NULL }
 };

char pacgen_gln[MAX_NAMES][MAX_PG2_NAME_SIZE];
int pacgen_gln_map[MAX_NAMES]; // map to gln ids, -1-not set,
int total_pacgen_names;
int pacgen_std_terrain_offset=-1;

int count_per_set[NO_OF_PACGEN_TIL_CLASSES];
int no_of_sets=NO_OF_PACGEN_TIL_CLASSES;

char class_name[NO_OF_PACGEN_TIL_CLASSES][4]={
"HQ_",
"CST", "CLR", "RD_", "RIV", "BCH", "RF_", "CTY",
"ISL", "MNT", "FRT", "LAK", "DES", "FRM", "DMT", "SF1",
"SF2" };

WORD pacgen_tt_to_pg_tile[NO_OF_PACGEN_TERRAIN_TYPES]= {
		              205, 26, 69, 69,129,146,129,146,146,131,
		              157,157, 69,129,124,131,183,131,124,131,
		              200,131,102,207, 52,183,129,157,207,124,
		               73, 73,129,128,128,158,129
                      };
int pacgen_tt_to_pg_tile_no=NO_OF_PACGEN_TERRAIN_TYPES;

unsigned char pacgen_class_2_pg_class[NO_OF_PACGEN_CLASSES]={0,1,2,3,4,5,6,7,15,12,13,14,12,13,11,8,9,10,16,17};
unsigned char pacgen_move_2_pg_move[NO_OF_PACGEN_MOVE_TYPES]={0,1,2,3,4,5,6,6,7,6,6};
unsigned char pacgen_target_type_2_pg_target_type[NO_OF_PACGEN_TARGET_TYPES]={0,1,2,3,3};

//typedef BITMAP *bmp_array[MAX_TILES];

struct ext_idx_struct {
	char name[8];
	int start;
	int stop;
} ext_idx[6];

struct idx_struct {
	char name[8];
	int size;
	int place;
};

struct pacgen_equ {
	BYTE class; //1
	BYTE sa,ha,aa,na,sub_a; //6
	BYTE gd,ad,assault_def,torpedo_def,depth_charge_def; //11
	BYTE target_type; //12
	BYTE bomber_size; //13
	BYTE uk1; //14 unknown
	BYTE ini, range, spotting; //17
	BYTE move_med; //18 0- surf, 1 - air
	BYTE move_type; //19 3-leg, 5 -air, 7-coastal-naval, etc
	BYTE mov, fuel, amo, life, uk3 ; //24
	BYTE prestige; //25
	BYTE pic_num[2]; // 27
	BYTE uk4[2]; //29 unknown
	BYTE month,year,last_year; //33
	BYTE transport; //34 0- none, 1-Naval ,2-Air Mobile,3-Airborne
	BYTE hangar_size;// 35
	BYTE countries[4];//39, bits for flags. 0x00200000 -Poland, 0x10000000 USA, etc
	BYTE special[4]; //43 special units attributes, like 14-"No buy", 1-"No AI buy" ,etc
	UWORD move_sound,attack_sound,death_sound; // 49 sound effects numbers
	BYTE fill[PACGEN_EQUIP_REC_SIZE-49];
};

struct pacgen_scn_unit {
 char unitname[40];
 BYTE  flag;//, owner 0x0e- japan, 0x1c - usa
 WORD  unit_id;
 WORD  unit_organic_transport_id;
 WORD  unit_seaair_transport_id;
 WORD unknow[2];
 WORD  X;
 WORD  Y;
 WORD  strength;
 WORD  unknown1[2];
 WORD  entranchment;
 BYTE  unknown2;
 WORD  experience;
BYTE fill[PACGEN_SCN_UNIT_REC_SIZE-(40+12*2+2)];
};

int import_pacgen_names_file(char *path) {

	FILE *inf;
	int max_names_file_size = MAX_NAMES * MAX_PG2_NAME_SIZE;
	char *end_of_line;

	inf = fopen(path, "rt");
	if (inf == NULL) {
		printf("Cannot open PacGen names file : %s\n", path);
		return ERROR_PACGEN_SCENARIO_NAMES_LOAD_BASE + ERROR_FPGE_FILE_NOT_FOUND;
	}
	total_pacgen_names = 0;

